&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодСостояния = Параметры.КодСостояния;
	ТелоОтвета = Параметры.ТелоОтвета;
	
	ПараметрыЗаголовкаОтвета.Очистить();
		
	СтандартныеЗаголовки = Новый Соответствие;
	СтандартныеЗаголовки.Вставить("WWW-Authenticate", Истина);
	СтандартныеЗаголовки.Вставить("Persistent-Auth", Истина);
	СтандартныеЗаголовки.Вставить("Content-Length", Истина);
	СтандартныеЗаголовки.Вставить("Server", Истина);
	СтандартныеЗаголовки.Вставить("Date", Истина);   
	СтандартныеЗаголовки.Вставить("Content-Type", Истина);  
	
	
	

	Для Каждого Элемент ИЗ Параметры.Заголовки Цикл
		Если СтандартныеЗаголовки.Получить(Элемент.Ключ) = Истина Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ПараметрыЗаголовкаОтвета.Добавить();
		НоваяСтрока.Имя = Элемент.Ключ;
		НоваяСтрока.Значение = Элемент.Значение;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтвет(Команда)
	МассивПараметрыЗаголовкаОтвета = Новый Массив;
	Для Каждого СтрокаТЧ ИЗ ПараметрыЗаголовкаОтвета Цикл
		МассивПараметрыЗаголовкаОтвета.Добавить(Новый Структура("Имя,Значение",СтрокаТЧ.Имя, СтрокаТЧ.Значение));		
	КонецЦикла;
	Оповестить("ДобавитьОтвет", Новый Структура("КодСостояния,ТелоОтвета,ПараметрыЗаголовкаОтвета", КодСостояния,ТелоОтвета,МассивПараметрыЗаголовкаОтвета));
    Закрыть();
	   
КонецПроцедуры

