
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	HTML 			=  Параметры.HTML;
	Значение 		= Параметры.Значение;
	Таблица 		= Параметры.Таблица;
	Поле  			= Параметры.Поле;
	НомерСтроки 	= Параметры.НомерСтроки;
	ТолькоПросмотр 	= ?(ЗначениеЗаполнено(Параметры.ТолькоПросмотр), Параметры.ТолькоПросмотр, Ложь);

	Если ТолькоПросмотр Тогда
		Элементы.ФормаОК.Видимость = Ложь;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	
	Если ЗначениеЗаполнено(Значение) тогда
		Editor().getModel().setValue(Значение);  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Editor()
	
	Возврат Элементы.HTML.Документ.defaultView.editor;
	
КонецФункции


&НаКлиенте
Функция ПолучитьСтрокуОтвета()
	
	СтрокаОтвета = "";
	Editor = Editor();
	Если НЕ Editor = неопределено тогда
		Model = Editor.getModel();
		Если Model.getLineCount() < 1001 тогда
			Возврат  Model.getValue();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ОК(Команда)    
	
	ВозвращаемоеЗначение = ПолучитьСтрокуОтвета();
	Оповестить("ИзменитьЗначениеОJSON", Новый Структура("НомерСтроки,Поле, Таблица, Значение", НомерСтроки,Поле,Таблица, ВозвращаемоеЗначение));
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура FormatJSON(Команда)
	
	Editor().getAction("editor.action.formatDocument").run();
	
КонецПроцедуры

