Функция productsGET(Запрос, ИдентификаторОбработчика) Экспорт 	
	
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);  
	HTTPОтвет.Заголовки.Вставить("Content-Type","text/text; charset=UTF-8");	
	СодержаниеОтвета = "[{""id"":1,""name"":""Смартфон XYZ"",""price"":599.99},{""id"":2,""name"":""Ноутбук ABC"",""price"":1299.99}]";
	HTTPОтвет.УстановитьТелоИзСтроки(СодержаниеОтвета);
	Возврат HTTPОтвет; 

КонецФункции

Функция productsPOST(ИдентификаторОбработчика, Запрос) Экспорт
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);  
	HTTPОтвет.УстановитьТелоИзСтроки(Строка(Новый УникальныйИдентификатор));
	Возврат HTTPОтвет;

КонецФункции
